vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G031_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.7.37" 
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.37/schema/PACK.xsd">
    <vendor>NSING</vendor>
    <url>https://www.nsing.com.sg/public/uploads/armpacks/</url>
    <name>N32G031_DFP</name>
    <description>Nsing N32G031 Series Device Support, Drivers and Examples</description>

    <releases>
		<release date="2024-08-14" version="1.0.5">		    
            First release of N32G031_DFP
        </release>
    </releases>

    <keywords>
        <keyword>NSING</keyword>
        <keyword>Device Support</keyword>
        <keyword>N32G031</keyword>
		<keyword>N32</keyword>
    </keywords>

    <devices>
        <family Dfamily="N32G031 Series" Dvendor="NSING:185">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <description>
The N32G031 series utilizes a 32-bit ARM Cortex-M0 core with operating frequency up to 48MHz. 

- Up to 64KB embedded encrypted Flash memory.
- 8KB SRAM.
- 1x 12bit 1Msps ADC and 1x high-speed comparators
- 2x USART, 1x LPUART, 2x I2C, 2x SPI, 1x OPAMP, 1x OPA and Beeper	
- Hardware Cryptographics Engine.
          </description>
  
        <subFamily DsubFamily="N32G031">
		   <processor Dclock="48000000"/>		   
           <compile header="firmware/CMSIS/device/n32g031.h" define="N32G031 USE_STDPERIPH_DRIVER"/>
	  	   <feature type="XTAL"     n="4000000"     m="48000000" name="Internal RC Oscillator"/>		   
	  	   <feature type="VCC"      n="1.80"        m="5.50"/>		
		   <feature type="Temp"     n="-40"        m="105"/>	
		   <feature type="RTC"      n="1"/>		   
		  <!-- *************************  Device 'N32G031F6'  ***************************** -->
		  <device Dname="N32G031F6"> 
		    <feature type="Memory"   n="32" 	name="32KB Flash"/>	
		    <feature type="Memory"   n="8" 		name="8KB SRAM"/>	
			<feature type="IOs"      n="16"     name="Input and Output Ports"/>
			<feature type="Timer"    n="5"/>
			<feature type="ADC"      n="7"     	m="12"  name="7-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>
			<feature type="UART"     n="1"/>				
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	

			<memory id="IRAM1"   start="0x20000000" size="0x2000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x1000" default="1" startup="1"/>
			<algorithm name="Flash/N32G031x.FLM" start="0x08000000" size="0x1000" default="1"/>
			<debug svd="svd/N32G031.svd"/>
          </device>	

		 <!-- *************************  Device 'N32G031K6'  ***************************** -->
		  <device Dname="N32G031K6"> 
		    <feature type="Memory"   n="32" 	name="32KB Flash"/>	
		    <feature type="Memory"   n="8" 		name="8KB SRAM"/>	
			<feature type="IOs"      n="26"     name="Input and Output Ports"/>
			<feature type="Timer"    n="5"/>
			<feature type="ADC"      n="10"      m="12"  name="10-ch 12bit ADC"/>	
			<feature type="USART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	

			<memory id="IRAM1"   start="0x20000000" size="0x2000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x8000" default="1" startup="1"/>
			<algorithm name="Flash/N32G031x.FLM" start="0x08000000" size="0x8000" default="1"/>
			<debug svd="svd/N32G031.svd"/>
          </device>	

		 <!-- *************************  Device 'N32G031K8'  ***************************** -->
		  <device Dname="N32G031K8"> 
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="8" 		name="8KB SRAM"/>	
			<feature type="IOs"      n="26"     name="Input and Output Ports"/>
			<feature type="Timer"    n="5"/>
			<feature type="ADC"      n="10"      m="12"  name="10-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	

			<memory id="IRAM1"   start="0x20000000" size="0x2000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G031x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G031.svd"/>
          </device>	
		 <!-- *************************  Device 'N32G031C8'  ***************************** -->
		  <device Dname="N32G031C8"> 
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="8" 		name="8KB SRAM"/>	
			<feature type="IOs"      n="40"     name="Input and Output Ports"/>
			<feature type="Timer"    n="5"/>
			<feature type="ADC"      n="12"      m="12"  name="10-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	

			<memory id="IRAM1"   start="0x20000000" size="0x2000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G031x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G031.svd"/>
          </device>	
		  
        </subFamily>
        </family>
    </devices>        

    <conditions>   
		<!-- Compiler Conditions -->
        <condition id="Compiler ARMCC">             
            <require Tcompiler="ARMCC"/>
        </condition>
		
		<!-- Device Conditions -->
		<condition id="N32G031">
		  <description>NSING N32G031 Devices</description> 
		  <require Dvendor="NSING:185" Dname="N32*"/> 
		</condition>
		
		<!-- Device + CMSIS Conditions -->
        <condition id="N32G031 CMSIS">            
		    <description>NSING N32G031 Device and the ARM compiler</description>
		    <require condition="N32G031"/>
		    <require Tcompiler="ARMCC"/>
        </condition>

		<!-- N32G031 STDPERIPHERALS RCC Conditions -->
        <condition id="N32G031 STDPERIPHERALS RCC">
            <description>NSING N32G031 Standard Peripherals driver with RCC</description>
            <require condition="N32G031 CMSIS"/>
            <require Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="RCC"/>
        </condition>
    </conditions>

    <components>
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="N32G031 CMSIS">
            <description>Startup File for Nsing N32G031 Series</description>
            <files>
                <file category="include" name="firmware/CMSIS/device/"/>
				<file category="header" name="firmware/CMSIS/device/n32g031.h"/>
				<!-- startup file -->				
                <file category="source" name="firmware/CMSIS/device/startup/startup_n32g031.s" attr="config"  version="1.0.0" condition="Compiler ARMCC"/>
				<!-- system file -->
                <file category="source" name="firmware/CMSIS/device/system_n32g031.c" attr="config" version="1.0.0"/>
				
            </files>
        </component>
		
	    <!-- N32G031_StdPeripherals -->		
        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="MISC" Cversion="1.0.0" condition="N32G031 CMSIS">
            <description>Standard Peripherals Drivers Framework</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FRAMEWORK
            </RTE_Components_h>
            <files>
                <file category="include" name="firmware/n32g031_std_periph_driver/inc/"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/misc.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="ADC" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>Analog-to-digital converter (ADC) driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ADC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_adc.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_adc.c"/>
            </files>
        </component>		

        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="BEEPER" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>BEEPER driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_BEEPER
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_beeper.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_beeper.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="COMP" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>Comparator (COMP) driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_COMP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_comp.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_comp.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="CRC" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>CRC calculation unit (CRC) driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CRC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_crc.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_crc.c"/>
            </files>
        </component>
		
       <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="DBG" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>MCU debug component (DBG) driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DBG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_dbg.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_dbg.c"/>
            </files>
        </component>
      
        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="EXTI" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>External interrupt/event controller (EXTI) driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_EXTI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_exti.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_exti.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="FLASH" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>Embedded Flash memory (FLASH) driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FLASH
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_flash.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_flash.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="GPIO" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>General-purpose I/O (GPIO) driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_GPIO
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_gpio.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_gpio.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="HDIV" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>High-speed divider (HDIV) interface driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_HDIV
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_hdiv.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_hdiv.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="I2C" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>Inter-integrated circuit (I2C) interface driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_I2C
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_i2c.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_i2c.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="IWDG" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>Independent watchdog (IWDG) driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_IWDG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_iwdg.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_iwdg.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="LPTIM" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>Low Power Timers (LPTIM) driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_LPTIM
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_lptim.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_lptim.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="LPUART" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>Low Power Universal asynchronous receiver transmitter (LPUART) driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_LPUART
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_lpuart.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_lpuart.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="OPAMP" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>Operational amplifier (OPAMP) driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_OPAMP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_opamp.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_opamp.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="PWR" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>Power controller (PWR) driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_PWR
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_pwr.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_pwr.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="RCC" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>Reset and clock control (RCC) driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RCC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_rcc.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_rcc.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="RTC" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>Real-time clock (RTC) driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RTC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_rtc.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_rtc.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="SPI" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>Serial peripheral interface (SPI) driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SPI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_spi.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_spi.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="TIMER" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>Timers (TIMER) driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_TIM
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_tim.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_tim.c"/>
            </files>
        </component>


        <!-- component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="TSC" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>Touch Sensing Controller (TSC) driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_TSC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_tsc.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_tsc.c"/>
            </files>
        </component -->
		
        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="USART" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>Universal asynchronous receiver transmitter (USART) driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_USART
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_usart.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_usart.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G031_StdPeripherals" Csub="WWDG" Cversion="1.0.0" condition="N32G031 STDPERIPHERALS RCC">
            <description>Window watchdog (WWDG) driver for N32G031</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_WWDG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g031_std_periph_driver/inc/n32g031_wwdg.h"/>
                <file category="source" name="firmware/n32g031_std_periph_driver/src/n32g031_wwdg.c"/>
            </files>
        </component>		
		
    </components>
</package>
